v2512/run/fcn-krxn/0.orig/C_CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C_CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0.0;

boundaryField
{
    surface
    {
        type       externalSpecieDiffusionResistance;
        H_cc       0.42;
        D_CO2      1.6e-9;
        C_CO2_g    1.8e-5;
        K_ext      6.4e-3;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    outlet
    {
        type            zeroGradient;
        value           $internalField;
    }
    "wedge.*"
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
        value           $internalField;
    }
}


// ************************************************************************* //
